var img1 = JSON.stringify({
	path:"pic/slide1.jpg",
	name: "Триград",
	description: "Трѝград е село в Южна България. То се намира в община Девин, област Смолян.Край Триград се намират три от Стоте национални туристически обекта — пещерата Дяволското гърло, Ягодинската пещера и Триградското ждрело.",
	tags: ["България", "Триград", "Ягодинска Пещера"]
	});
var img2 = JSON.stringify({
	path:"pic/slide6.jpg",
	name:"Рила",
	description: "Рѝла е най-високата планина в България и на Балканския полуостров. Намира се в югозападната част на страната, и по-точно в северозападния край на Рило-Родопския планински масив. Най-високият връх на планината — Мусала̀, със своите 2925,2 m е и най-високият на Балканския полуостров и цяла Източна Европа. ",
	tags: ["България", "Рила", 'Рилски езера']
});
var img3 = JSON.stringify({
	path:"pic/slide7.jpg",
	name:"Лалета",
	description: "Лале (Tulipa) е род покритосеменни растения от семейство Кремови (Liliaceae). Включва около 150 вида тревисти растения, разпространени в Южна Европа, Северна Африка, Близкия Изток и Централна Азия с най-голямо разнообразие в Памир, Хиндукуш и степните области на Казахстан. Лалетата се отглеждат масово като декоративни растения, като повечето култивирани подвидове, хибриди и култивари са базирани на вида Tulipa gesneriana.",
	tags: ['Лале']
});
var img4 = JSON.stringify({
	path:"pic/slide8.jpg",
	name:"Люлин",
	description: "Люлин е жилищен комплекс в София, наименуван на едноименната планина Люлин. Включен е в административен район „Люлин“ на Столичната община.Люлин е най-големият жилищен комплекс (комплекс с жилищни блокове) в България. По официални данни от 2001-ва година жителите му са 121 234, но според неофициални данни от 2007-ма броят им е нараснал до около 200 000 души.",
tags: ['Люлин']
});
var imgData = [img1,img2,img3,img4];
function traverseData (path,img){
	console.log('in traverse!!');
	for(var i = 0; i<imgData.length; i++){
		//imgObject is parsed JSON
		var imgObject = JSON.parse(imgData[i]);
		//console.log(imgObject);
		if (img.attr('src') == imgObject[path]){
			console.log("success");
			return imgObject;
		};
	}
	console.log("not found!");
};
